[
  {
    "woord": "hoofdgebruiker",
    "betekenis": "De hoofdgebruiker is Frederik Venneman. Frederik voert de beheerstaken uit voor klanten. Daarnaast maake Frederik de eerste versie van het platform voor klanten van Data panel."
  },
  {
    "woord": "json",
    "betekenis": "JSON is een afkorting voor JavaScript Object Notation. Stofloos gebruikt JSON om al hun configuraties op de website mee te doen. Er wordt door deze JSON bepaald welke data op welke pagina moet, en hoe die data er uit moet zien, maar ook welke velden formulieren hebben. Alles wat er te zien is op de pagina, is daar door een JSON configuratie."
  },
  {
    "woord": "renderen",
    "betekenis": "Renderen is het weergeven van stukken visuele code."
  },
  {
    "woord": "rendered",
    "betekenis": "Renderen is het weergeven van stukken visuele code."
  },
  {
    "woord": "gerenderde",
    "betekenis": "Renderen is het weergeven van stukken visuele code."
  },
  {
    "woord": "mvp",
    "betekenis": "MVP is een afkorting voor Minimum Viable Product. Een MVP omvat de minimale functionaliteiten van een website of app om levensvatbaar te zijn."
  },
  {
    "woord": "form-builder",
    "betekenis": "Een form builder is een applicatie waarin formulieren en enquêtes in gemaakt kunnen worden."
  },
  {
    "woord": "form-builders",
    "betekenis": "Een form builder is een applicatie waarin formulieren en enquêtes in gemaakt kunnen worden."
  },
  {
    "woord": "componenten",
    "betekenis": "Een component is een onderdeel van een groter geheel."
  },
  {
    "woord": "component",
    "betekenis": "Een component is een onderdeel van een groter geheel."
  },
  {
    "woord": "geïntegreerd",
    "betekenis": "Integreren is het maken, groeien of opnemen in een groter geheel. In een applicatie kunnen stukken code van een andere partij worden toegevoegd. Hier is sprake van integratie van die code."
  },
  {
    "woord": "design guidelines",
    "betekenis": "Design guidelines zijn regels die bepalen hoe het ontwerp eruit moet komen zien. Kleuren, rondheid van hoeken, afstandgroottes en meer staan hierin beschreven"
  },
  {
    "woord": "user interface",
    "betekenis": "Een user interface (UI) is de omgeving waarin de gebruiker zijn/haar acties uitvoert op de website."
  },
  {
    "woord": "ui",
    "betekenis": "Een user interface (UI) is de omgeving waarin de gebruiker zijn/haar acties uitvoert op de website."
  },
  {
    "woord": "git",
    "betekenis": "Een website voor versiecontrol van applicaties."
  },
  {
    "woord": "commit",
    "betekenis": "Een kopie van een stuk code dat is verwijderd, toegevoegd of aangepast."
  },
  {
    "woord": "commits",
    "betekenis": "Een kopie van een stuk code dat is verwijderd, toegevoegd of aangepast."
  },
  {
    "woord": "branch",
    "betekenis": "Een kopie van het project waar enkel de veranderingen in de code worden meegenomen als de kopie met het origineel wordt samengevoegt."
  },
  {
    "woord": "model",
    "betekenis": "Een collectie van data-atributen (elementen) in de database."
  },
  {
    "woord": "database",
    "betekenis": "Waar data wordt opgeslagen"
  },
  {
    "woord": "header",
    "betekenis": "Bovenste gedeelte van een applicatie. Vaak staat hier het menu of kan het menu vanuit hier geopend worden."
  },
  {
    "woord": "sectie",
    "betekenis": "In deze applicatie is een sectie een gedeelte van een formulier."
  },
  {
    "woord": "secties",
    "betekenis": "In deze applicatie is een sectie een gedeelte van een formulier."
  },
  {
    "woord": "margins",
    "betekenis": "Margin is de ruimte tussen een element en haar parent."
  },
  {
    "woord": "paddings",
    "betekenis": "Padding is de ruimte tussen de buitenste rand van het element en de content."
  },
  {
    "woord": "border-radius",
    "betekenis": "Scherpte van een hoek."
  },
  {
    "woord": "modal",
    "betekenis": "Een modal is een pop-up waar acties in uitgevoerd kunnen worden."
  },
  {
    "woord": "refactoren",
    "betekenis": "Het verbeteren en herschrijven van code"
  },
  {
    "woord": "data structuur",
    "betekenis": "Data structuur is de structuur waarop database tabellen met elkaar verbonden zijn"
  },
  {
    "woord": "hoveren",
    "betekenis": "Hoveren is je muis ergenst overheen houden, zoals je nu doet!"
  }
 
]
